//commit- это контральна€ точка, котора€ содержит симки всех нужных файлов репозитори€.
//		ƒл€ того чтобы создать commit об€зательно нужно написать commit-massage, без него невозможно создать commit.
//		»з коммита можно доставать отдельные файлы дл€ их востонавленни€, так и весь репозиторий целиком. 
//		ѕоследовательность коммитов называетс€ веткой (branch)
//branch- это последовательность commit-ов. ” каждой ветки сво€ истори€
//		¬ любов репозитории обычно присутвует одна ветка(master)
//master- это главна€ ветка в любом репозитории, где лежит оснавной код, остальные ветки 
//		создаютс€ дл€ изменений и исправлений. ќни позвол€ют не повредить рабочий исходный код.
//		¬ последствии после внесений всех обходимых изменений и исправлений ветки вливаютс€ в мастер при помощи процедуры merge.
//merge- сли€ние (¬етка). ќбычно выполн€етс€ через pull-request
//pull-request- запрос на сли€ние веток 
//ћы будем использовать ветки дл€ того что бы поразному писать один и тот же исходный код

